/*
 * Copyright (C) 2021 HiSilicon (Shanghai) Technologies CO., LIMITED.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 */

/* ****************************************************************************
  1 头文件包含
**************************************************************************** */
#include "wal_regdb.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/* ****************************************************************************
  2 全局变量定义
**************************************************************************** */
/* 下面的国家码用“XX”方式更合理，lin_t e784告警屏蔽 */
/*
    以下管制域数据库由工具生成:
    Step 1: 从http://wireless.kernel.org/download/wireless-regdb/regulatory.bins/
            下载最新的管制域二进制文件regulatory.bin
    Step 2: regdbdump regulatory.bin >> db.txt
    Step 3: kernel/net/wireless/genregdb.awk db.txt >> wal_regdb.c
 */
/* 根据WIFI-2.4G-国家码信道对应表更新管制域信息 */
/* ****************************************************************************
  阿拉伯联合酋长国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ae = {
    .alpha2 = "AE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  阿富汗管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_af = {
    .alpha2 = "AF",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  安提瓜和巴布达管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ag = {
    .alpha2 = "AG",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  安圭拉岛管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ai = {
    .alpha2 = "AI",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  阿尔巴尼亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_al = {
    .alpha2 = "AL",
    .reg_rules = {
        reg_rule(2402, 2482, 20, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  亚美尼亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_am = {
    .alpha2 = "AM",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  AN管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_an = {
    .alpha2 = "AN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  安哥拉管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ao = {
    .alpha2 = "AO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  阿根廷管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ar = {
    .alpha2 = "AR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  AS管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_as = {
    .alpha2 = "AS",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  奥地利管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_at = {
    .alpha2 = "AT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  澳大利亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_au = {
    .alpha2 = "AU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  AW管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_aw = {
    .alpha2 = "AW",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  阿塞拜疆管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_az = {
    .alpha2 = "AZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  BA管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ba = {
    .alpha2 = "BA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  孟加拉国	管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bd = {
    .alpha2 = "BD",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  比利时管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_be = {
    .alpha2 = "BE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  保加利亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bg = {
    .alpha2 = "BG",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴林管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bh = {
    .alpha2 = "BH",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴勒斯坦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bl = {
    .alpha2 = "BL",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  百慕大群岛管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bm = {
    .alpha2 = "BM",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  文莱管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bn = {
    .alpha2 = "BN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  玻利维亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bo = {
    .alpha2 = "BO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴西管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_br = {
    .alpha2 = "BR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴哈马管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bs = {
    .alpha2 = "BS",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  白俄罗斯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_by = {
    .alpha2 = "BY",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  伯利兹管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_bz = {
    .alpha2 = "BZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  加拿大管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ca = {
    .alpha2 = "CA",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  瑞士管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ch = {
    .alpha2 = "CH",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  智利管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cl = {
    .alpha2 = "CL",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  中国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cn = {
    .alpha2 = "CN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 27, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  哥伦比亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_co = {
    .alpha2 = "CO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  哥斯达黎加管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cr = {
    .alpha2 = "CR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  捷克管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cs = {
    .alpha2 = "CS",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  古巴管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cu = {
    .alpha2 = "CU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  塞浦路斯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cy = {
    .alpha2 = "CY",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  捷克管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_cz = {
    .alpha2 = "CZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  德国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_de = {
    .alpha2 = "DE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  丹麦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_dk = {
    .alpha2 = "DK",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  多米尼加共和国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_do = {
    .alpha2 = "DO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  阿尔及利亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_dz = {
    .alpha2 = "DZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  厄瓜多尔管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ec = {
    .alpha2 = "EC",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  爱沙尼亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ee = {
    .alpha2 = "EE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  埃及管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_eg = {
    .alpha2 = "EG",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  西班牙管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_es = {
    .alpha2 = "ES",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  埃塞俄比亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_et = {
    .alpha2 = "ET",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  芬兰管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_fi = {
    .alpha2 = "FI",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  法国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_fr = {
    .alpha2 = "FR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  英国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gb = {
    .alpha2 = "GB",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  格林纳达管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gd = {
    .alpha2 = "GD",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  格鲁吉亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ge = {
    .alpha2 = "GE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  法属圭亚那管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gf = {
    .alpha2 = "GF",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  GL管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gl = {
    .alpha2 = "GL",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  希腊管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gr = {
    .alpha2 = "GR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  危地马拉管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gt = {
    .alpha2 = "GT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  关岛管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_gu = {
    .alpha2 = "GU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  香港特别行政区管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_hk = {
    .alpha2 = "HK",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  洪都拉斯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_hn = {
    .alpha2 = "HN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  HR管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_hr = {
    .alpha2 = "HR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  匈牙利管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_hu = {
    .alpha2 = "HU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 3
};
/* ****************************************************************************
  印度尼西亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_id = {
    .alpha2 = "ID",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  爱尔兰管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ie = {
    .alpha2 = "IE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  以色列管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_il = {
    .alpha2 = "IL",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  印度管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_in = {
    .alpha2 = "IN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  伊拉克管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_iq = {
    .alpha2 = "IQ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  伊朗管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ir = {
    .alpha2 = "IR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  冰岛管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_is = {
    .alpha2 = "IS",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  意大利管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_it = {
    .alpha2 = "IT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  牙买加管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_jm = {
    .alpha2 = "JM",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  约旦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_jo = {
    .alpha2 = "JO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  日本管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_jp = {
    .alpha2 = "JP",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
        reg_rule(2474, 2494, 20, 0, 20,
            NL80211_RRF_NO_OFDM | 0),
    },
    .n_reg_rules = 2
};
/* ****************************************************************************
  肯尼亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ke = {
    .alpha2 = "KE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  柬埔寨管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_kh = {
    .alpha2 = "KH",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  朝鲜管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_kp = {
    .alpha2 = "KP",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  韩国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_kr = {
    .alpha2 = "KR",
    .reg_rules = {
        reg_rule(2402, 2482, 20, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  科威特管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_kw = {
    .alpha2 = "KW",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  KY管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ky = {
    .alpha2 = "KY",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  哈萨克斯坦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_kz = {
    .alpha2 = "KZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  老挝管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_la = {
    .alpha2 = "LA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  黎巴嫩管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_lb = {
    .alpha2 = "LB",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  列支敦士登管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_li = {
    .alpha2 = "LI",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  斯里兰卡管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_lk = {
    .alpha2 = "LK",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  莱索托管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ls = {
    .alpha2 = "LS",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  立陶宛管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_lt = {
    .alpha2 = "LT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  卢森堡管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_lu = {
    .alpha2 = "LU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  拉脱维亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_lv = {
    .alpha2 = "LV",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  摩洛哥管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ma = {
    .alpha2 = "MA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  摩纳哥管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mc = {
    .alpha2 = "MC",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  摩尔多瓦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_md = {
    .alpha2 = "MD",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  ME管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_me = {
    .alpha2 = "ME",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  MH管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mh = {
    .alpha2 = "MH",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  MK管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mk = {
    .alpha2 = "MK",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  蒙古管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mn = {
    .alpha2 = "MN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  澳门管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mo = {
    .alpha2 = "MO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  MR管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mr = {
    .alpha2 = "MR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  马耳他管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mt = {
    .alpha2 = "MT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  毛里求斯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mu = {
    .alpha2 = "MU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  马尔代夫管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mv = {
    .alpha2 = "MV",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  马拉维管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mw = {
    .alpha2 = "MW",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  墨西哥管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_mx = {
    .alpha2 = "MX",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  马来西亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_my = {
    .alpha2 = "MY",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  尼加拉瓜管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ni = {
    .alpha2 = "NI",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  尼日利亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ng = {
    .alpha2 = "NG",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  荷兰管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_nl = {
    .alpha2 = "NL",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  挪威管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_no = {
    .alpha2 = "NO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  尼泊尔管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_np = {
    .alpha2 = "NP",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  新西兰管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_nz = {
    .alpha2 = "NZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  阿曼管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_om = {
    .alpha2 = "OM",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴拿马管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pa = {
    .alpha2 = "PA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  秘鲁管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pe = {
    .alpha2 = "PE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴布亚新几内亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pg = {
    .alpha2 = "PG",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  菲律宾管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ph = {
    .alpha2 = "PH",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴基斯坦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pk = {
    .alpha2 = "PK",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  波兰管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pl = {
    .alpha2 = "PL",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  波多黎各管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pr = {
    .alpha2 = "PR",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  葡萄牙管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_pt = {
    .alpha2 = "PT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  巴拉圭管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_py = {
    .alpha2 = "PY",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  卡塔尔管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_qa = {
    .alpha2 = "QA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  RE管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_re = {
    .alpha2 = "RE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  罗马尼亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ro = {
    .alpha2 = "RO",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  RS管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_rs = {
    .alpha2 = "RS",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  俄罗斯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ru = {
    .alpha2 = "RU",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  沙特阿拉伯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sa = {
    .alpha2 = "SA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  苏丹管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sd = {
    .alpha2 = "SD",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  瑞典管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_se = {
    .alpha2 = "SE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  新加坡管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sg = {
    .alpha2 = "SG",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  斯洛文尼亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_si = {
    .alpha2 = "SI",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  斯洛伐克管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sk = {
    .alpha2 = "SK",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  塞内加尔管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sn = {
    .alpha2 = "SN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  萨尔瓦多管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sv = {
    .alpha2 = "SV",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  叙利亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_sy = {
    .alpha2 = "SY",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  泰国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_th = {
    .alpha2 = "TH",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  突尼斯管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_tn = {
    .alpha2 = "TN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  土耳其管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_tr = {
    .alpha2 = "TR",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  特立尼达和多巴哥管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_tt = {
    .alpha2 = "TT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  台湾省管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_tw = {
    .alpha2 = "TW",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  乌克兰管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ua = {
    .alpha2 = "UA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20,
            NL80211_RRF_NO_OUTDOOR | 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  乌干达管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ug = {
    .alpha2 = "UG",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  美国管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_us = {
    .alpha2 = "US",
    .reg_rules = {
        reg_rule(2402, 2472, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  乌拉圭管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_uy = {
    .alpha2 = "UY",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  乌兹别克斯坦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_uz = {
    .alpha2 = "UZ",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 3, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  VA管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_va = {
    .alpha2 = "VA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  委内瑞拉管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ve = {
    .alpha2 = "VE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  VI管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_vi = {
    .alpha2 = "VI",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 30, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  越南管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_vn = {
    .alpha2 = "VN",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  也门管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_ye = {
    .alpha2 = "YE",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  YT管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_yt = {
    .alpha2 = "YT",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  南非管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_za = {
    .alpha2 = "ZA",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  赞比亚管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_zm = {
    .alpha2 = "ZM",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  津巴布韦管制域信息
**************************************************************************** */
static const struct ieee80211_regdomain g_regdom_zw = {
    .alpha2 = "ZW",
    .reg_rules = {
        reg_rule(2402, 2482, 40, 0, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    },
    .n_reg_rules = 1
};
/* ****************************************************************************
  管制域信息数据库
**************************************************************************** */
/* country alpha2 code can search from http://en.wikipedia.org/wiki/ISO_3166-1_alpha-2 */
const struct ieee80211_regdomain * const g_reg_regdb[] = {
    &g_regdom_ae,
    &g_regdom_af,
    &g_regdom_ag,
    &g_regdom_ai,
    &g_regdom_al,
    &g_regdom_am,
    &g_regdom_an,
    &g_regdom_ao,
    &g_regdom_ar,
    &g_regdom_as,
    &g_regdom_at,
    &g_regdom_au,
    &g_regdom_aw,
    &g_regdom_az,
    &g_regdom_ba,
    &g_regdom_bd,
    &g_regdom_be,
    &g_regdom_bg,
    &g_regdom_bh,
    &g_regdom_bl,
    &g_regdom_bm,
    &g_regdom_bn,
    &g_regdom_bo,
    &g_regdom_br,
    &g_regdom_bs,
    &g_regdom_by,
    &g_regdom_bz,
    &g_regdom_ca,
    &g_regdom_ch,
    &g_regdom_cl,
    &g_regdom_cn,
    &g_regdom_co,
    &g_regdom_cr,
    &g_regdom_cs,
    &g_regdom_cu,
    &g_regdom_cy,
    &g_regdom_cz,
    &g_regdom_de,
    &g_regdom_dk,
    &g_regdom_do,
    &g_regdom_dz,
    &g_regdom_ec,
    &g_regdom_ee,
    &g_regdom_eg,
    &g_regdom_es,
    &g_regdom_et,
    &g_regdom_fi,
    &g_regdom_fr,
    &g_regdom_gb,
    &g_regdom_gd,
    &g_regdom_ge,
    &g_regdom_gf,
    &g_regdom_gl,
    &g_regdom_gr,
    &g_regdom_gt,
    &g_regdom_gu,
    &g_regdom_hk,
    &g_regdom_hn,
    &g_regdom_hr,
    &g_regdom_hu,
    &g_regdom_id,
    &g_regdom_ie,
    &g_regdom_il,
    &g_regdom_in,
    &g_regdom_iq,
    &g_regdom_ir,
    &g_regdom_is,
    &g_regdom_it,
    &g_regdom_jm,
    &g_regdom_jo,
    &g_regdom_jp,
    &g_regdom_ke,
    &g_regdom_kh,
    &g_regdom_kp,
    &g_regdom_kr,
    &g_regdom_kw,
    &g_regdom_ky,
    &g_regdom_kz,
    &g_regdom_la,
    &g_regdom_lb,
    &g_regdom_li,
    &g_regdom_lk,
    &g_regdom_ls,
    &g_regdom_lt,
    &g_regdom_lu,
    &g_regdom_lv,
    &g_regdom_ma,
    &g_regdom_mc,
    &g_regdom_md,
    &g_regdom_me,
    &g_regdom_mh,
    &g_regdom_mk,
    &g_regdom_mn,
    &g_regdom_mo,
    &g_regdom_mr,
    &g_regdom_mt,
    &g_regdom_mu,
    &g_regdom_mv,
    &g_regdom_mw,
    &g_regdom_mx,
    &g_regdom_my,
    &g_regdom_ng,
    &g_regdom_ni,
    &g_regdom_nl,
    &g_regdom_no,
    &g_regdom_np,
    &g_regdom_nz,
    &g_regdom_om,
    &g_regdom_pa,
    &g_regdom_pe,
    &g_regdom_pg,
    &g_regdom_ph,
    &g_regdom_pk,
    &g_regdom_pl,
    &g_regdom_pr,
    &g_regdom_pt,
    &g_regdom_py,
    &g_regdom_qa,
    &g_regdom_re,
    &g_regdom_ro,
    &g_regdom_rs,
    &g_regdom_ru,
    &g_regdom_sa,
    &g_regdom_sd,
    &g_regdom_se,
    &g_regdom_sg,
    &g_regdom_si,
    &g_regdom_sk,
    &g_regdom_sn,
    &g_regdom_sv,
    &g_regdom_sy,
    &g_regdom_th,
    &g_regdom_tn,
    &g_regdom_tr,
    &g_regdom_tt,
    &g_regdom_tw,
    &g_regdom_ua,
    &g_regdom_ug,
    &g_regdom_us,
    &g_regdom_uy,
    &g_regdom_uz,
    &g_regdom_va,
    &g_regdom_ve,
    &g_regdom_vi,
    &g_regdom_vn,
    &g_regdom_ye,
    &g_regdom_yt,
    &g_regdom_za,
    &g_regdom_zm,
    &g_regdom_zw,
};

/* 配置管制域信息 */
const oal_ieee80211_regdomain_stru *g_reg_regdb_cfg = &g_default_regdom;

/* 默认管制域信息 */
const oal_ieee80211_regdomain_stru g_default_regdom = {
    .n_reg_rules = 1,
    .alpha2 =  "99",
    .reg_rules = {
        /* IEEE 802.11b/g, 信道 1..13 */
        reg_rule(2402, 2482, 40, 6, 20, 0), /* 结构体全局变量的子结构体元素初始化赋值,结构精简,lin_t e651告警屏蔽 */
    }
};

/* ****************************************************************************
  3 函数实现
**************************************************************************** */
/* 设置配置管制域信息 */
hi_void wal_set_cfg_regdb(const oal_ieee80211_regdomain_stru *regdom)
{
    g_reg_regdb_cfg = regdom;
}

/* 获取配置管制域信息 */
const oal_ieee80211_regdomain_stru *wal_get_cfg_regdb(hi_void)
{
    return g_reg_regdb_cfg;
}

/* ****************************************************************************
 函 数 名  : wal_regdb_find_db
 功能描述  : 根据国家字符串查找管制域数据库
 输入参数  : 无
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2013年10月16日
    作    者   : HiSilicon
    修改内容   : 新生成函数

**************************************************************************** */
const oal_ieee80211_regdomain_stru *wal_regdb_find_db(const hi_char *pc_str)
{
    hi_u32 l_db_idx;

    if (oal_unlikely(pc_str == HI_NULL)) {
        return HI_NULL;
    }
    /* 默认管制域 */
    if ((pc_str[0] == '9') && (pc_str[1] == '9')) {
        return &g_default_regdom;
    }

    for (l_db_idx = 0; l_db_idx < array_size(g_reg_regdb); l_db_idx++) {
        if ((pc_str[0] == g_reg_regdb[l_db_idx]->alpha2[0]) && (pc_str[1] == g_reg_regdb[l_db_idx]->alpha2[1])) {
            return g_reg_regdb[l_db_idx];
        }
    }
    return HI_NULL;
}

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif
